; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v1 - type_1 ?v6 - type_3)
 	      (pred_4 ?v4 - object ?v6 - type_3)
	      (pred_2 ?v1 - type_1 ?v3 - type_2)
	      (pred_3 ?v1 - type_1 ?v4 - object ?v3 - type_2))

   (:action op_3
       :parameters  (?v1 - type_1 ?v7 ?v2 - type_3)
       :precondition (and  (pred_1 ?v1 ?v7))
       :effect (and  (pred_1 ?v1 ?v2)
		     (not (pred_1 ?v1 ?v7))))

   (:action op_1
       :parameters (?v1 - type_1 ?v5 - object ?v8 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v8) (pred_1 ?v1 ?v8) (pred_2 ?v1 ?v3))
       :effect (and (pred_3 ?v1 ?v5 ?v3)
		    (not (pred_4 ?v5 ?v8)) 
		    (not (pred_2 ?v1 ?v3))))

   (:action op_2
       :parameters (?v1 - type_1 ?v5 - object ?v8 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v5 ?v3) (pred_1 ?v1 ?v8))
       :effect (and (pred_4 ?v5 ?v8)
		    (pred_2 ?v1 ?v3)
		    (not (pred_3 ?v1 ?v5 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_12 obj_14 - type_1
obj_07 obj_09 obj_10 obj_08 - type_2
obj_11 obj_03 obj_02 obj_01 - type_3
obj_06 obj_04 obj_05 obj_13 - object)
(:init
(pred_1 obj_12 obj_01)
(pred_2 obj_12 obj_07)
(pred_2 obj_12 obj_09)
(pred_1 obj_14 obj_02)
(pred_2 obj_14 obj_10)
(pred_2 obj_14 obj_08)
(pred_4 obj_06 obj_02)
(pred_4 obj_04 obj_02)
(pred_4 obj_05 obj_01)
(pred_4 obj_13 obj_03)
)
(:goal
(and
(pred_4 obj_06 obj_01)
(pred_4 obj_04 obj_01)
(pred_4 obj_05 obj_03)
(pred_4 obj_13 obj_02)
)
)

(:constraints
  (always (not (pred_1 obj_12 obj_02)))
)
)

; plan
1. (op_3 obj_12 obj_01 obj_11)
   deleted: (pred_1 obj_12 obj_01)
   added: (pred_1 obj_12 obj_11)
   goals met: 0 of 4
2. (op_1 obj_14 obj_04 obj_02 obj_08)
   deleted: (pred_4 obj_04 obj_02) (pred_2 obj_14 obj_08)
   added: (pred_3 obj_14 obj_04 obj_08)
   goals met: 0 of 4
3. (op_3 obj_12 obj_11 obj_03)
   deleted: (pred_1 obj_12 obj_11)
   added: (pred_1 obj_12 obj_03)
   goals met: 0 of 4
4. (op_3 obj_14 obj_02 obj_01)
   deleted: (pred_1 obj_14 obj_02)
   added: (pred_1 obj_14 obj_01)
   goals met: 0 of 4
5. (op_1 obj_12 obj_13 obj_03 obj_09)
   deleted: (pred_4 obj_13 obj_03) (pred_2 obj_12 obj_09)
   added: (pred_3 obj_12 obj_13 obj_09)
   goals met: 0 of 4
6. (op_2 obj_14 obj_04 obj_01 obj_08)
   deleted: (pred_3 obj_14 obj_04 obj_08)
   added: (pred_4 obj_04 obj_01) (pred_2 obj_14 obj_08)
   goals met: 1 of 4
7. (op_1 obj_14 obj_05 obj_01 obj_10)
   deleted: (pred_4 obj_05 obj_01) (pred_2 obj_14 obj_10)
   added: (pred_3 obj_14 obj_05 obj_10)
   goals met: 1 of 4
8. (op_3 obj_14 obj_01 obj_03)
   deleted: (pred_1 obj_14 obj_01)
   added: (pred_1 obj_14 obj_03)
   goals met: 1 of 4
9. (op_3 obj_12 obj_03 obj_01)
   deleted: (pred_1 obj_12 obj_03)
   added: (pred_1 obj_12 obj_01)
   goals met: 1 of 4
10. (op_2 obj_14 obj_05 obj_03 obj_10)
   deleted: (pred_3 obj_14 obj_05 obj_10)
   added: (pred_4 obj_05 obj_03) (pred_2 obj_14 obj_10)
   goals met: 2 of 4
11. (op_2 obj_12 obj_13 obj_01 obj_09)
   deleted: (pred_3 obj_12 obj_13 obj_09)
   added: (pred_4 obj_13 obj_01) (pred_2 obj_12 obj_09)
   goals met: 2 of 4
12. (op_3 obj_14 obj_03 obj_02)
   deleted: (pred_1 obj_14 obj_03)
   added: (pred_1 obj_14 obj_02)
   goals met: 2 of 4
13. (op_1 obj_14 obj_06 obj_02 obj_08)
   deleted: (pred_4 obj_06 obj_02) (pred_2 obj_14 obj_08)
   added: (pred_3 obj_14 obj_06 obj_08)
   goals met: 2 of 4
14. (op_3 obj_14 obj_02 obj_01)
   deleted: (pred_1 obj_14 obj_02)
   added: (pred_1 obj_14 obj_01)
   goals met: 2 of 4
15. (op_2 obj_14 obj_06 obj_01 obj_08)
   deleted: (pred_3 obj_14 obj_06 obj_08)
   added: (pred_4 obj_06 obj_01) (pred_2 obj_14 obj_08)
   goals met: 3 of 4
16. (op_1 obj_14 obj_13 obj_01 obj_08)
   deleted: (pred_4 obj_13 obj_01) (pred_2 obj_14 obj_08)
   added: (pred_3 obj_14 obj_13 obj_08)
   goals met: 3 of 4
17. (op_3 obj_14 obj_01 obj_02)
   deleted: (pred_1 obj_14 obj_01)
   added: (pred_1 obj_14 obj_02)
   goals met: 3 of 4
18. (op_2 obj_14 obj_13 obj_02 obj_08)
   deleted: (pred_3 obj_14 obj_13 obj_08)
   added: (pred_4 obj_13 obj_02) (pred_2 obj_14 obj_08)
   goals met: 4 of 4
